In [1]:
import pandas as pd

In [2]:
person = pd.read_csv('Person.csv')
address = pd.read_csv('Address.csv')

In [4]:
person

   personId lastName firstName
0         1     Wang     Allen
1         2    Alice       Bob

In [5]:
address

   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

In [7]:
merge_table = pd.merge(person,address,how = 'left',left_on = 'personId', right_on = 'personId')
merge_table[['firstName','lastName','city','state']]

  firstName lastName           city     state
0     Allen     Wang            NaN       NaN
1       Bob    Alice  New York City  New York